Revit 2027 API
ParameterTypeId.EnergyAnalysisProjectPhase Property
 "Phase"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId EnergyAnalysisProjectPhase { get; }
Public Shared ReadOnly Property EnergyAnalysisProjectPhase As ForgeTypeId
	Get
public:
static property ForgeTypeId^ EnergyAnalysisProjectPhase {
	ForgeTypeId^ get ();
}
static member EnergyAnalysisProjectPhase : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace